#pragma once
#include <Manager.h>

//{----------------------------------------------------------------------------------------------------------------
//! @ingroup UI
//! @brief   Главное окно-менеджер приложения
//!
//! @see     Manager
//! @endcode
//}----------------------------------------------------------------------------------------------------------------
struct MainWindow : Manager
{
    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Конструктор MainWindow
    //!
    //! @param   _app       Ссылка на управляющий класс
    //! @see     AbstractAppData
    //! 
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    MainWindow(AbstractAppData* _app) :
        Manager(_app)
    {
    }

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Данная функция вызывается при изменении размеров приложения или при необходимости изменить расположение дочерних окон
    //!
    //! @param   managerSize       Размер более старшего окна, поскольку его нет, то это размер приложения
    //! @param   _newRect          Желаемый размер данной менеджера, в большинстве случаев просто {}
    //!
    //! @return  0
    //!
    //!
    //! @usage @code
    //! appData->mainManager->onSize(appData->systemSettings->SizeOfScreen);
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    virtual int onSize(Vector managerSize, Rect _newRect = {}) override;
};